Data Collection And Wrangling

In [12]:
import pandas as pd 
import numpy as np

In [13]:
data = { 'Name':['ijaz','waheed','furqan','jazz','jay','jon','Huda'],
        'Age': [13,23,24,25,27,19,25],
        'Gender':['M','M','M','M','M','M','F'],
        'Marks':[90,50,59,'NaN',89,'NaN','NaN']

}

In [14]:
df =pd.DataFrame(data)
df

     Name  Age Gender Marks
0    ijaz   13      M    90
1  waheed   23      M    50
2  furqan   24      M    59
3    jazz   25      M   NaN
4     jay   27      M    89
5     jon   19      M   NaN
6    Huda   25      F   NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   7 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [9]:
df.dtypes

Name      object
Age        int64
Gender    object
Marks     object
dtype: object

In [11]:
df.sample(3)

     Name  Age Gender Marks
0    ijaz   13      M    90
1  waheed   23      M    50
4     jay   27      M    89

In [12]:
df.head()

     Name  Age Gender Marks
0    ijaz   13      M    90
1  waheed   23      M    50
2  furqan   24      M    59
3    jazz   25      M   Nan
4     jay   27      M    89

In [13]:
df.tail()

     Name  Age Gender Marks
2  furqan   24      M    59
3    jazz   25      M   Nan
4     jay   27      M    89
5     jon   19      M   Nan
6    Huda   25      F    79

In [15]:
new_df = df.replace('NaN',np.nan)
new_df

     Name  Age Gender  Marks
0    ijaz   13      M   90.0
1  waheed   23      M   50.0
2  furqan   24      M   59.0
3    jazz   25      M    NaN
4     jay   27      M   89.0
5     jon   19      M    NaN
6    Huda   25      F    NaN

In [16]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   4 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 352.0+ bytes

Dealing with Missing Values

In [17]:
# compute avarge 
c = avg = 0
for ele in df['Marks']:
    if str(ele).isnumeric():
        c += 1
        avg += ele
avg /= c

In [18]:
# replace mising values
df =df.replace(to_replace='NaN', value=avg)
df

     Name  Age Gender  Marks
0    ijaz   13      M   90.0
1  waheed   23      M   50.0
2  furqan   24      M   59.0
3    jazz   25      M   72.0
4     jay   27      M   89.0
5     jon   19      M   72.0
6    Huda   25      F   72.0

In [51]:
df.mean()

C:\Users\AFC\AppData\Local\Temp\ipykernel_14184\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Age      22.285714
Marks    72.000000
dtype: float64

                                        Reshapping the Data

In [19]:
df['Gender'] = df['Gender'].map({'M':0,'F':1}).astype(float)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      float64
 3   Marks   7 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes

                    Filtering Data

In [23]:
# get marker which is  greater than 80marks 
df[df['Marks'] >= 80]

   Name  Age  Gender  Marks
0  ijaz   13     0.0   90.0
4   jay   27     0.0   89.0

                                 Delete drop a columna

In [28]:
# drop a columna
agedrop = df.drop(['Age','Name'] , axis=1)
agedrop

   Gender  Marks
0     0.0   90.0
1     0.0   50.0
2     0.0   59.0
3     0.0   72.0
4     0.0   89.0
5     0.0   72.0
6     1.0   72.0

In [29]:
df

     Name  Age  Gender  Marks
0    ijaz   13     0.0   90.0
1  waheed   23     0.0   50.0
2  furqan   24     0.0   59.0
3    jazz   25     0.0   72.0
4     jay   27     0.0   89.0
5     jon   19     0.0   72.0
6    Huda   25     1.0   72.0

Data Wrangling and data cleaning take 70% time of the project

                  Pandas Introduction  Emerging Technologies

In [49]:
import  pandas as pd 
import numpy as np

Series

In [50]:
# creating empty series from contructor 
ser = pd.Series()
print(ser)

Series([], dtype: float64)

C:\Users\AFC\AppData\Local\Temp\ipykernel_21416\1176602800.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()

In [53]:
#simple array 
data = np.array(['a','e','i','o','u'])
ser = pd.Series(data)
print(ser)

0    a
1    e
2    i
3    o
4    u
dtype: object

Dataframe

In [54]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [56]:
# create list of String
List = ['We','are','trying','Dataframe','Creation']
df = pd.DataFrame(List)
df

           0
0         We
1        are
2     trying
3  Dataframe
4   Creation

         Pandas Read SQL + Code Example

In [61]:
from sqlite3 import connect
# connection with database

#conn = connect("Datasets\stocks.db")

# read with csv 
#data = pd.read_csv('data.csv')

# save data into a sql table
# data.to_sql("meta",conn)
#select all the data from table

#df =pd.read_sql("SELECT  From meta LIMIT 5",conn)
#df =pd.read_sql("SELECT  From meta  WHERE date= "2022-01-05" LIMIT 5",conn)
#print(df)

# must close the db
#conn.close()

                                 Pandas Read CSV, Excel & Json Files Code

In [65]:
import  pandas as pd 
import numpy as np

#read from excel / csv file 
#df= pd.read_csv("filename.csv")

In [66]:
import pandas as pd 
#df= pd.read_json(r'filename.json')
print(df)

           0
0         We
1        are
2     trying
3  Dataframe
4   Creation

           Pandas Cheat Sheets | Data Collection & Wrangling